export const mockDialogDoctor = [
  '您好，您想了解哪位病人的情況呢?',
  'A123456林美美肺癌預後狀況如何? 會早期轉移嗎?',
  '病人林美美有一個3公分邊緣不規則腫塊，在影像組學和病理均顯示有EGFR突變。\n與大資料庫比對顯示，三年存活期機率較低，有短期轉移的可能。',
  '用藥建議?',
  '建議直接先用第三線EGFR小分子藥物，台灣可以使用，但目前必須自費，該藥品可能會產生類粉刺皮疹及對光線過敏。'
]

export const mockDialogPatient = [
  '林美美小姐 您好，您想了解什麼呢?',
  '我的肺癌檢查結果出來了嗎?',
  '您的檢查結果已完成，您右邊肺部有一個3公分的腫塊，依CT影像和病理檢驗結果均顯示為EGFR基因突變陽性。經過大數據比較，三年存活期的機率比較低。',
  '有建議治療的方式嗎?',
  '建議進行手術和第三線標靶藥物，目前藥物必須自費。',
  '藥物有哪些副作用?',
  '這個藥物可能會產生類粉刺皮疹及對光線過敏。'
]

export const mockDialogNurse = [
  '您好，您想了解哪位病人的情況呢?',
  'A123456林美美的化療標靶治療副作用是什麼?',
  '根據病人的資料，可能的副作用會有：皮膚問題、指甲變化、疲勞、食慾不振、噁心、嘔吐、腹瀉。\n罕見但嚴重的副作用包含：間質性肺病(ILD)/肺炎、心肌損傷、心律變化。',
  '要如何處理?',
  '護理照護應提供密切觀察和適當的支持，並提供心理支持和衛教。'
]
